{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "copy0", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_copy", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_data_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_sc_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn1_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn1_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn2_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_bn2_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_sc_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn1_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn1_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn2_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_bn2_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_moving_mean_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_moving_var_1", 
      "inputs": []
    }, 
    {
      "op": "_tensorrt_subgraph_op", 
      "name": "_tensorrt_subgraph_op0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "_tensorrt_forward", 
        "num_inputs": "98", 
        "num_outputs": "1"
      }, 
      "inputs": [
        [1, 0, 0], 
        [2, 0, 0], 
        [3, 0, 0], 
        [4, 0, 0], 
        [5, 0, 0], 
        [6, 0, 0], 
        [7, 0, 0], 
        [8, 0, 0], 
        [9, 0, 0], 
        [10, 0, 0], 
        [11, 0, 0], 
        [12, 0, 0], 
        [13, 0, 0], 
        [14, 0, 0], 
        [15, 0, 0], 
        [16, 0, 0], 
        [17, 0, 0], 
        [18, 0, 0], 
        [19, 0, 0], 
        [20, 0, 0], 
        [21, 0, 0], 
        [22, 0, 0], 
        [23, 0, 0], 
        [24, 0, 0], 
        [25, 0, 0], 
        [26, 0, 0], 
        [27, 0, 0], 
        [28, 0, 0], 
        [29, 0, 0], 
        [30, 0, 0], 
        [31, 0, 0], 
        [32, 0, 0], 
        [33, 0, 0], 
        [34, 0, 0], 
        [35, 0, 0], 
        [36, 0, 0], 
        [37, 0, 0], 
        [38, 0, 0], 
        [39, 0, 0], 
        [40, 0, 0], 
        [41, 0, 0], 
        [42, 0, 0], 
        [43, 0, 0], 
        [44, 0, 0], 
        [45, 0, 0], 
        [46, 0, 0], 
        [47, 0, 0], 
        [48, 0, 0], 
        [49, 0, 0], 
        [50, 0, 0], 
        [51, 0, 0], 
        [52, 0, 0], 
        [53, 0, 0], 
        [54, 0, 0], 
        [55, 0, 0], 
        [56, 0, 0], 
        [57, 0, 0], 
        [58, 0, 0], 
        [59, 0, 0], 
        [60, 0, 0], 
        [61, 0, 0], 
        [62, 0, 0], 
        [63, 0, 0], 
        [64, 0, 0], 
        [65, 0, 0], 
        [66, 0, 0], 
        [67, 0, 0], 
        [68, 0, 0], 
        [69, 0, 0], 
        [70, 0, 0], 
        [71, 0, 0], 
        [72, 0, 0], 
        [73, 0, 0], 
        [74, 0, 0], 
        [75, 0, 0], 
        [76, 0, 0], 
        [77, 0, 0], 
        [78, 0, 0], 
        [79, 0, 0], 
        [80, 0, 0], 
        [81, 0, 0], 
        [82, 0, 0], 
        [83, 0, 0], 
        [84, 0, 0], 
        [85, 0, 0], 
        [86, 0, 0], 
        [87, 0, 0], 
        [88, 0, 0], 
        [89, 0, 0], 
        [90, 0, 0], 
        [91, 0, 0], 
        [92, 0, 0], 
        [93, 0, 0], 
        [94, 0, 0], 
        [95, 0, 0], 
        [96, 0, 0], 
        [97, 0, 0], 
        [98, 0, 0]
      ], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "copy0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "bn_data_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "bn_data_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "bn_data_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "bn_data_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm0", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "False", 
                "target": "cuda"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "conv0_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d0", 
              "attrs": {
                "channels": "64", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[7, 7]", 
                "layout": "NCHW", 
                "padding": "(3, 3)", 
                "strides": "(2, 2)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[5, 0, 0], [6, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "bn0_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "bn0_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "bn0_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "bn0_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm1", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu0", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[12, 0, 0]]
            }, 
            {
              "op": "max_pool2d", 
              "name": "max_pool2d0", 
              "attrs": {
                "ceil_mode": "False", 
                "padding": "(1, 1)", 
                "pool_size": "[3, 3]", 
                "strides": "(2, 2)", 
                "target": "cuda"
              }, 
              "inputs": [[13, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage1_unit1_bn1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage1_unit1_bn1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage1_unit1_bn1_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage1_unit1_bn1_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm2", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu1", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[19, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage1_unit1_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d1", 
              "attrs": {
                "channels": "64", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[20, 0, 0], [21, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage1_unit1_bn2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage1_unit1_bn2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage1_unit1_bn2_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage1_unit1_bn2_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm3", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu2", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[27, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage1_unit1_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d2", 
              "attrs": {
                "channels": "64", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[28, 0, 0], [29, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage1_unit1_sc_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d3", 
              "attrs": {
                "channels": "64", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[1, 1]", 
                "layout": "NCHW", 
                "padding": "(0, 0)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[20, 0, 0], [31, 0, 0]]
            }, 
            {
              "op": "elemwise_add", 
              "name": "elemwise_add0", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[30, 0, 0], [32, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage1_unit2_bn1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage1_unit2_bn1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage1_unit2_bn1_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage1_unit2_bn1_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm4", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu3", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[38, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage1_unit2_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d4", 
              "attrs": {
                "channels": "64", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[39, 0, 0], [40, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage1_unit2_bn2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage1_unit2_bn2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage1_unit2_bn2_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage1_unit2_bn2_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm5", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu4", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[46, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage1_unit2_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d5", 
              "attrs": {
                "channels": "64", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[47, 0, 0], [48, 0, 0]]
            }, 
            {
              "op": "elemwise_add", 
              "name": "elemwise_add1", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[49, 0, 0], [33, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage2_unit1_bn1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage2_unit1_bn1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage2_unit1_bn1_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage2_unit1_bn1_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm6", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu5", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[55, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage2_unit1_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d6", 
              "attrs": {
                "channels": "128", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(2, 2)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[56, 0, 0], [57, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage2_unit1_bn2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage2_unit1_bn2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage2_unit1_bn2_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage2_unit1_bn2_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm7", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu6", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[63, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage2_unit1_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d7", 
              "attrs": {
                "channels": "128", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[64, 0, 0], [65, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage2_unit1_sc_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d8", 
              "attrs": {
                "channels": "128", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[1, 1]", 
                "layout": "NCHW", 
                "padding": "(0, 0)", 
                "strides": "(2, 2)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[56, 0, 0], [67, 0, 0]]
            }, 
            {
              "op": "elemwise_add", 
              "name": "elemwise_add2", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[66, 0, 0], [68, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage2_unit2_bn1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage2_unit2_bn1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage2_unit2_bn1_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage2_unit2_bn1_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm8", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu7", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[74, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage2_unit2_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d9", 
              "attrs": {
                "channels": "128", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[75, 0, 0], [76, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage2_unit2_bn2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage2_unit2_bn2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage2_unit2_bn2_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage2_unit2_bn2_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm9", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu8", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[82, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage2_unit2_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d10", 
              "attrs": {
                "channels": "128", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[83, 0, 0], [84, 0, 0]]
            }, 
            {
              "op": "elemwise_add", 
              "name": "elemwise_add3", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[85, 0, 0], [69, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage3_unit1_bn1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage3_unit1_bn1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage3_unit1_bn1_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage3_unit1_bn1_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm10", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu9", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[91, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage3_unit1_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d11", 
              "attrs": {
                "channels": "256", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(2, 2)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[92, 0, 0], [93, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage3_unit1_bn2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage3_unit1_bn2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage3_unit1_bn2_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage3_unit1_bn2_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm11", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu10", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[99, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage3_unit1_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d12", 
              "attrs": {
                "channels": "256", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[100, 0, 0], [101, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage3_unit1_sc_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d13", 
              "attrs": {
                "channels": "256", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[1, 1]", 
                "layout": "NCHW", 
                "padding": "(0, 0)", 
                "strides": "(2, 2)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[92, 0, 0], [103, 0, 0]]
            }, 
            {
              "op": "elemwise_add", 
              "name": "elemwise_add4", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[102, 0, 0], [104, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage3_unit2_bn1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage3_unit2_bn1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage3_unit2_bn1_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage3_unit2_bn1_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm12", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu11", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[110, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage3_unit2_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d14", 
              "attrs": {
                "channels": "256", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[111, 0, 0], [112, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage3_unit2_bn2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage3_unit2_bn2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage3_unit2_bn2_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage3_unit2_bn2_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm13", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 0], [117, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu12", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[118, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage3_unit2_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d15", 
              "attrs": {
                "channels": "256", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[119, 0, 0], [120, 0, 0]]
            }, 
            {
              "op": "elemwise_add", 
              "name": "elemwise_add5", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[121, 0, 0], [105, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage4_unit1_bn1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage4_unit1_bn1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage4_unit1_bn1_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage4_unit1_bn1_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm14", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 0], [126, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu13", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[127, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage4_unit1_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d16", 
              "attrs": {
                "channels": "512", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(2, 2)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[128, 0, 0], [129, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage4_unit1_bn2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage4_unit1_bn2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage4_unit1_bn2_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage4_unit1_bn2_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm15", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[130, 0, 0], [131, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu14", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[135, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage4_unit1_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d17", 
              "attrs": {
                "channels": "512", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[136, 0, 0], [137, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage4_unit1_sc_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d18", 
              "attrs": {
                "channels": "512", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[1, 1]", 
                "layout": "NCHW", 
                "padding": "(0, 0)", 
                "strides": "(2, 2)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[128, 0, 0], [139, 0, 0]]
            }, 
            {
              "op": "elemwise_add", 
              "name": "elemwise_add6", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[138, 0, 0], [140, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage4_unit2_bn1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage4_unit2_bn1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage4_unit2_bn1_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage4_unit2_bn1_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm16", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[141, 0, 0], [142, 0, 0], [143, 0, 0], [144, 0, 0], [145, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu15", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[146, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage4_unit2_conv1_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d19", 
              "attrs": {
                "channels": "512", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[147, 0, 0], [148, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage4_unit2_bn2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage4_unit2_bn2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage4_unit2_bn2_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "stage4_unit2_bn2_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm17", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0], [152, 0, 0], [153, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu16", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[154, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "stage4_unit2_conv2_weight0", 
              "inputs": []
            }, 
            {
              "op": "conv2d", 
              "name": "conv2d20", 
              "attrs": {
                "channels": "512", 
                "dilation": "(1, 1)", 
                "groups": "1", 
                "kernel_layout": "OIHW", 
                "kernel_size": "[3, 3]", 
                "layout": "NCHW", 
                "padding": "(1, 1)", 
                "strides": "(1, 1)", 
                "target": "cuda", 
                "use_bias": "False"
              }, 
              "inputs": [[155, 0, 0], [156, 0, 0]]
            }, 
            {
              "op": "elemwise_add", 
              "name": "elemwise_add7", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[157, 0, 0], [141, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "bn1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "bn1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "bn1_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "bn1_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "batch_norm", 
              "name": "batch_norm18", 
              "attrs": {
                "axis": "1", 
                "center": "True", 
                "epsilon": "2e-05", 
                "scale": "True", 
                "target": "cuda"
              }, 
              "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0], [161, 0, 0], [162, 0, 0]]
            }, 
            {
              "op": "relu", 
              "name": "relu17", 
              "attrs": {"target": "cuda"}, 
              "inputs": [[163, 0, 0]]
            }, 
